app/views/users/show.html.erb

                <small>
                    <%= pluralize(@user.posts.count, 'post') %>,
                    <%= pluralize(@user.comments.count, 'comment') %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY rank DESC  [["user_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]

<h2>Posts</h2>
<% if @user.posts.any? %>
---
SELECT  1 AS one FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

<h2>Comments</h2>
<% if @user.comments.any? %>
---
SELECT  1 AS one FROM "comments" WHERE "comments"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

<h2>Favorites</h2>
<% if @user.favorites.any? %>
---
SELECT  1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]