app/controllers/posts_controller.rb

  def show
    @topic = Topic.find(params[:topic_id])
    @post = Post.find(params[:id])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 38], ["LIMIT", 1]]

  def new
    @topic = Topic.find(params[:topic_id])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
     @topic = Topic.find(params[:topic_id])
     @post = @topic.posts.build(post_params)
     @post.user = current_user


     if @post.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "topic_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "testy"], ["body", "test test test test test"], ["created_at", "2017-10-24 22:03:56.766636"], ["updated_at", "2017-10-24 22:03:56.766636"], ["topic_id", 2], ["user_id", 1]]

  def edit
    @topic = Topic.find(params[:topic_id])
    @post = Post.find(params[:id])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
     @post = Post.find(params[:id])
     @post.assign_attributes(post_params)

     if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "hi hi"], ["updated_at", "2017-10-17 20:18:01.505156"], ["id", 1]]

   def destroy
     @post = Post.find(params[:id])

     if @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 51], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]