app/controllers/questions_controller.rb

  def show
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @question = Question.find(params[:id])
    if @question.update_attributes(params.require(:question).permit(:title, :body, :resolved))
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "questions" SET "resolved" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["resolved", "t"], ["updated_at", "2017-10-17 22:21:25.044677"], ["id", 2]]

  def destroy
    @question = Question.find(params[:id])
    if @question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 2]]