app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics"
---
    def index
        @topics = Topic.all

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @topic = Topic.find(params[:id])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @topic = Topic.find(params[:id])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "topics" SET "name" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["name", "Mark!!!"], ["updated_at", "2017-10-18 22:49:15.851114"], ["id", 1]]
---
    def update
        @topic = Topic.find(params[:id])

        @topic.assign_attributes(topic_params)

        if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]
---
    def destroy
        @topic = Topic.find(params[:id])

        if @topic.destroy